cases/example-cases/jetFlow/constant/polyMesh/blockMeshDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices        
(
    (-50     0.00   -50)
    ( 50     0.00   -50)
    ( 50     0.00    50)
    (-50     0.00    50)
    (-2.20   0.00   -2.20)
    ( 2.20   0.00   -2.20)
    ( 2.20   0.00    2.20)
    (-2.20   0.00    2.20)

    (-50     300    -50)
    ( 50     300    -50)
    ( 50     300     50)
    (-50     300     50)
    (-2.20   300    -2.20)
    ( 2.20   300    -2.20)
    ( 2.20   300     2.20)
    (-2.20   300     2.20)


);

blocks          
(
    hex (0 1 9 8 4 5 13 12)   (8 120 24) simpleGrading (1 1 0.06)
    hex (1 2 10 9 5 6 14 13)  (8 120 24) simpleGrading (1 1 0.06)
    hex (2 3 11 10 6 7 15 14) (8 120 24) simpleGrading (1 1 0.06)
    hex (3 0 8 11 7 4 12 15)  (8 120 24) simpleGrading (1 1 0.06)
    hex (4 5 13 12 7 6 14 15) (8 120 8) simpleGrading (1 1 1)
);

edges           
( arc 0 1   (-0.000000  0.000000  -70.7107)
    arc 1 2   ( 70.7107  0.000000  -0.000000)
    arc 2 3   ( 0.000000  0.000000   70.7107)
    arc 3 0   (-70.7107  0.000000   0.000000)

    arc 4 5   (-0.000000  0.000000  -2.500000)
    arc 5 6   ( 2.500000  0.000000  -0.000000)
    arc 6 7   ( 0.000000  0.000000   2.500000)
    arc 7 4   (-2.500000  0.000000   0.000000)

    arc 8 9   (-0.000000  300.0000  -70.7107)
    arc 9 10  ( 70.7107   300.0000  -0.000000)
    arc 10 11 ( 0.000000  300.0000   70.7107)
    arc 11 8  (-70.7107   300.0000   0.000000)

    arc 12 13 (-0.000000  300.0000  -2.500000)
    arc 13 14 ( 2.500000  300.0000  -0.000000)
    arc 14 15 ( 0.000000  300.0000   2.500000)
    arc 15 12 (-2.500000  300.0000   0.000000)
);

boundary         
(
    outer
    {
        type patch;
        faces
        (
            (0 1 9 8)
            (1 2 10 9)
            (2 3 11 10)
            (3 0 8 11)
        );
    }
    bottom
    {
        type patch;
        faces
        (
            (0 1 5 4)
            (1 2 6 5)
            (2 3 7 6)
            (3 0 4 7)
        );
    }
    top
    {
        type patch;
        faces
        (
            (8 9 13 12)
            (9 10 14 13)
            (10 11 15 14)
            (11 8 12 15)
            (12 13 14 15)
        );
    }

    inlet
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
