cases/example-cases/jetFlow/0/nut
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           volScalarField;
    object          p;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    outer
    {
       type             zeroGradient;
    }
    top
    {
        type            zeroGradient;
    }
    bottom
    {
       type             zeroGradient;
    }
    inlet
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
